package demo;

/**
 * Demo01
 *
 * 最短寻路问题
 *
 * 上 下 左 右 四个方向
 *
 * 指定初始点位置和目标点位置
 *
 * 行动器为上下左右各方向分别行动1格
 *
 * 接收器为当前位置
 *
 */
public class Demo01 {

    public static void main(String[] args) {

        /**
         * 存储信息链的地方-队列
         *
         * 获取信息链函数
         *
         * 构造信息链函数
         *
         * 插入信息链到-队列
         *
         * '''
         *
         * '''
         * 校验target并排序队列
         *
         * 校验函数
         *
         * 插入函数
         *
         * 排序函数
         */


    }
}
